In [ ]:
# https://pandas.pydata.org/pandas-docs/version/0.15/10min.html

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.032362  1.138761  0.941612  0.383717
2013-01-02  0.657576  0.233388  0.077291 -0.976674
2013-01-03  0.559430  2.040221  0.804067  1.728731
2013-01-04  0.794944  2.826797  1.359335  1.042253
2013-01-05 -0.375510  0.390475  1.532759  0.550323
2013-01-06  1.488357  0.507728  2.150859  0.524526

In [7]:
df2 = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C' : pd.Series(1, index = list(range(4)), dtype = 'float32'),
                   'D' : np.array([3] * 4, dtype='int32'),
                   'E' : pd.Categorical(["test", "train", "test", "train"]),
                   'F' : 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [49]:
df = pd.DataFrame(
{
    'a' : [4, 5, 6],       # 리스트도 가능
    'b' : [7, 8, 9],
    'c' : [10, 11, 12]
},
    index = [1, 2, 3]       # 문자열도 가능
)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [50]:
dic = {
    'a' : [4, 5, 6],
    'b' : [7, 8, 9],
    'c' : [10, 11, 12]
}
df = pd.DataFrame(dic, index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [29]:
list = [[4, 5, 6], [7, 8, 9], [10, 11, 12]]    # 데이터프레임에서는 컬럼(열)단위가 기본
df = pd.DataFrame(list, index = [1, 2, 3])     # 리스트는 컬럼 단위로 들어가지 않음 -> 딕셔너리 사용
df

    0   1   2
1   4   5   6
2   7   8   9
3  10  11  12